// pagesB/waterfall/waterfall.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      {
        pic: "https://mod.happy2cs.com/common/index_bg2.png",
        text: "1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111"
      },
      {
        pic: "https://mod.happy2cs.com/common/A.png",
        text: "2222222222222222222222222222222222222222222222222222222222222222222222222222"
      },
      {
        pic: "https://mod.happy2cs.com/common/B.png",
        text: "3333333333333333333333333333333333333333333333333333333333333333"
      },
      {
        pic: "https://mod.happy2cs.com/common/D.png",
        text: "4"
      } 
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})